// 日干+月支
export const SFTK_DAYGAN_MONTH = {
	甲: {
		子: '【金不换髓歌断】\n甲日子提为印绶，顺行不似逆行高。\n官多杀盛东为美，午未相逢总徒劳。\n来源：《神峰通考》卷二——金不换髓歌\n',
		丑: '【金不换髓歌断】\n阳木天元值丑提，分明大运喜东西。\n发财发福多荣达，午未之中亦不宜。\n来源：《神峰通考》卷二——金不换髓歌\n',
		寅: '【金不换髓歌断】\n甲木生东值孟春，财多杀重定超群。\n顺行火地多难显，逆走终为富贵人。\n来源：《神峰通考》卷二——金不换髓歌\n',
		卯: '【金不换髓歌断】\n阳木春生值卯提，柱中有杀最为奇。\n不拘逆顺东南地，申酉相逢反不宜。\n来源：《神峰通考》卷二——金不换髓歌\n',
		辰: '【金不换髓歌断】\n甲木辰提喜有官，逆行东地弗为欢。\n顺行南地多颠倒，除是根深富贵看。\n来源：《神峰通考》卷二——金不换髓歌\n',
		巳: '【金不换髓歌断】\n阳木根深在巳月，柱中财杀喜相逢。\n逆行早岁声名显，顺行须防夭寿终。\n来源：《神峰通考》卷二——金不换髓歌\n',
		午: '【金不换髓歌断】\n甲木日干居午月，伤官木火喜生财。\n顺行怕入西方运，东北行来更妙哉。\n来源：《神峰通考》卷二——金不换髓歌\n',
		未: '【金不换髓歌断】\n阳木有根生六月，财官有气福非常。\n逆行最喜东方运，惟恐初生寿不长。\n来源：《神峰通考》卷二——金不换髓歌\n',
		申: '【金不换髓歌断】\n甲木无根值孟秋，财多杀旺恨身柔。\n运行顺地迟方好，逆运须防夭更休。\n来源：《神峰通考》卷二——金不换髓歌\n',
		酉: '【金不换髓歌断】\n甲木酉提用正官，顺行坎地必成欢。\n逆转南离官被制，须知禄尽见阎王。\n来源：《神峰通考》卷二——金不换髓歌\n',
		戌: '【金不换髓歌断】\n甲木戌提用财官，顺运东南福更宽。\n若得柱中逢亥未，逆行名姓达金鸾。\n来源：《神峰通考》卷二——金不换髓歌\n',
		亥: '【金不换髓歌断】\n甲木生元值亥提，柱中有杀更为奇。\n中年最喜东方运，午未之中数不齐。\n来源：《神峰通考》卷二——金不换髓歌\n'
	},
	乙: {
		子: '【金不换髓歌断】\n乙木生居子月中，更无官煞喜匆匆。\n逆行大运非常美，无杀无官逆运通。\n来源：《神峰通考》卷二——金不换髓歌\n',
		丑: '【金不换髓歌断】\n乙木提纲值丑官，南方第一次西东。\n纵然名不登金榜，豪富终须比石崇。\n来源：《神峰通考》卷二——金不换髓歌\n',
		寅: '【金不换髓歌断】\n乙生寅月木伤官，财杀相逢更有欢。\n顺运连行多福禄，无财无杀亦贫寒。\n来源：《神峰通考》卷二——金不换髓歌\n',
		卯: '【金不换髓歌断】\n乙木提纲值仲春，财官有气亦超群。\n火金大运皆为美，白手兴家迈等伦。\n来源：《神峰通考》卷二——金不换髓歌\n',
		辰: '【金不换髓歌断】\n乙木辰提为杂气，西方大运亦为高。\n若行戌运多颠倒，刑并入财寿不牢。\n来源：《神峰通考》卷二——金不换髓歌\n',
		巳: '【金不换髓歌断】\n乙木相逢孟夏时，运行东北始为奇。\n柱中更值无根裔，顺运终防寿不齐。\n来源：《神峰通考》卷二——金不换髓歌\n',
		午:
			'查询条件：日干+月支\n【金不换髓歌断】\n乙木如逢午月天，食神有气怕身轻。\n柱中若是根基薄，大运提防喜逆行。\n来源：《神峰通考》卷二——金不换髓歌\n',
		未: '【金不换髓歌断】\n未月生逢乙日干，柱中官杀亦为欢。\n顺行西北伤元寿，逆走东南福更宽。\n来源：《神峰通考》卷二——金不换髓歌\n',
		申: '【金不换髓歌断】\n乙木生来值孟秋，财官印绶忌身柔。\n中年不许行西北，顺运无如逆运通。\n来源：《神峰通考》卷二——金不换髓歌\n',
		酉: '【金不换髓歌断】\n乙木酉月杀多强，大运功名佐庙廊。\n若是有根尤更妙，南行火运贵非常。\n来源：《神峰通考》卷二——金不换髓歌\n',
		戌: '【金不换髓歌断】\n乙生戌月多财杀，惟恐初年疾病生。\n若到中年多发达，不拘顺逆总宜行。\n来源：《神峰通考》卷二——金不换髓歌\n',
		亥: '【金不换髓歌断】\n乙木居亥印生身，逆走西南富贵真。\n有杀有官犹喜顺，到头大限怕逢辰。\n来源：《神峰通考》卷二——金不换髓歌\n'
	},
	丙: {
		子: '【金不换髓歌断】\n丙火冬生值子纲，有印生身大吉昌。\n运入东南多发达，逆行难保寿年长。\n来源：《神峰通考》卷二——金不换髓歌\n',
		丑: '【金不换髓歌断】\n丙火如逢丑月看，土多格局作伤官。\n印多运入西方美，根浅东南福不全。\n来源：《神峰通考》卷二——金不换髓歌\n',
		寅: '【金不换髓歌断】\n丙多官杀值寅提，运入南方分外奇。\n若是官轻尤喜北，总然大运要行西。\n来源：《神峰通考》卷二——金不换髓歌\n',
		卯: '【金不换髓歌断】\n丙火日干卯提纲，干弱如逢喜火乡。\n若是无官尤不利，却行身旺亦平常。\n来源：《神峰通考》卷二——金不换髓歌\n',
		辰: '【金不换髓歌断】\n丙火辰提戊己多，伤官火土更如何。\n逢财逢印多通达，南北相逢总不过。\n来源：《神峰通考》卷二——金不换髓歌\n',
		巳: '【金不换髓歌断】\n丙火建禄日干强，官杀相逢大吉昌。\n顺逆运行多发达，若行戌运有灾殃。\n来源：《神峰通考》卷二——金不换髓歌\n',
		午: '【金不换髓歌断】\n丙火午月作伤官，有杀当为贵命看。\n金水运行多吉利，如行水地不为欢。\n来源：《神峰通考》卷二——金不换髓歌\n',
		未: '【金不换髓歌断】\n丙逢未月伤官显，官杀相逢未足奇。\n如得独官为贵气，运行西北利名驰。\n来源：《神峰通考》卷二——金不换髓歌\n',
		申: '【金不换髓歌断】\n丙火申提日主柔，得从得化始为优。\n若从水位伤元寿，逆去东南福禄周。\n来源：《神峰通考》卷二——金不换髓歌\n',
		酉: '【金不换髓歌断】\n丙逢酉月火衰微，比劫扶身寿不奇。\n逆去东南为背禄，顺行水地始为奇。\n来源：《神峰通考》卷二——金不换髓歌\n',
		戌: '【金不换髓歌断】\n丙逢戌月土重重，有杀无官回不同。\n大运顺行多富贵，若逢官杀亦中中。\n来源：《神峰通考》卷二——金不换髓歌\n',
		亥: '【金不换髓歌断】\n丙火亥提为杀印，分明大运喜东南。\n中年富贵非常美，运若西方寿不齐。\n来源：《神峰通考》卷二——金不换髓歌\n'
	},
	丁: {
		子: '【金不换髓歌断】\n丁火如逢子月提，柱中有杀更无亏。\n平生最喜东方运，若到西方福不齐。\n来源：《神峰通考》卷二——金不换髓歌\n',
		丑: '【金不换髓歌断】\n丁火丑月事如何，四柱分明怕土多。\n运入东方俱发达，南方火地不相宜。\n来源：《神峰通考》卷二——金不换髓歌\n',
		寅: '【金不换髓歌断】\n丁火逢寅印绶明，柱中有水喜南行。\n运行北地尤通达，西方财乡祸患生。\n来源：《神峰通考》卷二——金不换髓歌\n',
		卯: '【金不换髓歌断】\n丁逢卯月有印星，南北应多遂利名。\n独杀若无官混杂，金章紫绶至公卿。\n来源：《神峰通考》卷二——金不换髓歌\n',
		辰: '【金不换髓歌断】\n丁逢辰月本伤官，顺入南方福更宽。\n逆运初年多蹇剥，更逢戌亥寿相干。\n来源：《神峰通考》卷二——金不换髓歌\n',
		巳: '【金不换髓歌断】\n丁逢巳月本刚强，大运何愁入水乡。\n运入顺行初不利，中年最喜入西方。\n来源：《神峰通考》卷二——金不换髓歌\n',
		午: '【金不换髓歌断】\n丁逢建禄本身强，无水须防寿不全。\n若得运中逢七杀，姓名远达九重天。\n来源：《神峰通考》卷二——金不换髓歌\n',
		未: '【金不换髓歌断】\n未月逢丁要见财，无财到底命多乖。\n若逢财杀方为美，西方大运更奇哉。\n来源：《神峰通考》卷二——金不换髓歌\n',
		申: '【金不换髓歌断】\n丁逢申月日干强，大运南方喜逆行。\n若是根深尤喜顺，中年发达更峥嵘。\n来源：《神峰通考》卷二——金不换髓歌\n',
		酉: '【金不换髓歌断】\n丁逢酉月用偏财，官杀相逢更妙哉。\n大运逆行多顺遂，功名两字称心怀。\n来源：《神峰通考》卷二——金不换髓歌\n',
		戌: '【金不换髓歌断】\n丁逢戌月伤官旺，官杀虽多却不防。\n南与东方多顺遂，荣华富贵福无疆。\n来源：《神峰通考》卷二——金不换髓歌\n',
		亥: '【金不换髓歌断】\n丁生亥月用官星，顺逆东南福不轻。\n若是煞星多混杂，寿年尤恐半凋零。\n来源：《神峰通考》卷二——金不换髓歌\n'
	},
	戊: {
		子: '【金不换髓歌断】\n戊土日干生子月，坐支辰戌最为奇。\n支虚更值财神位，运怕东兮又怕西。\n来源：《神峰通考》卷二——金不换髓歌\n',
		丑: '【金不换髓歌断】\n戊土丑月日干坚，更有财官福寿全。\n逆顺运行俱得地，若无财杀亦徒然。\n来源：《神峰通考》卷二——金不换髓歌\n',
		寅: '【金不换髓歌断】\n戊土寅月日干轻，杀印相生格局明。\n运入火乡尤发达，逆行水地总平平。\n来源：《神峰通考》卷二——金不换髓歌\n',
		卯: '【金不换髓歌断】\n戊土卯月用官星，有印相生格局清。\n南运发财强北运，如逢酉地寿元倾。\n来源：《神峰通考》卷二——金不换髓歌\n',
		辰: '【金不换髓歌断】\n戊土辰月日干强，更有财星福禄昌。\n顺运西南应发达，财官轻处亦非良。\n来源：《神峰通考》卷二——金不换髓歌\n',
		巳: '【金不换髓歌断】\n戊土巳提为建禄，柱中财杀更为奇。\n逆行大运宜东北，顺走西南事不齐。\n来源：《神峰通考》卷二——金不换髓歌\n',
		午: '【金不换髓歌断】\n戊土五月印当权，大运分明喜杀官。\n官杀重时宜顺运，官轻逆运妙无端。\n来源：《神峰通考》卷二——金不换髓歌\n',
		未: '【金不换髓歌断】\n戊土生来季夏天，若无财煞未周全。\n逆行更喜东方运，顺逆财多亦不然。\n来源：《神峰通考》卷二——金不换髓歌',
		申: '【金不换髓歌断】\n戊土生申用食神，有财有煞贵堪伦。\n逆行火地必通达，火地行来反受屯。\n来源：《神峰通考》卷二——金不换髓歌\n',
		酉: '【金不换髓歌断】\n戊土生来值酉提，怕行坎水喜火离。\n除非四柱元辰旺，卯运相逢最不宜。\n来源：《神峰通考》卷二——金不换髓歌\n',
		戌: '【金不换髓歌断】\n戊土戌月日干强，财杀重逢更吉祥。\n运气不拘行顺逆，若无财杀亦平常。\n来源：《神峰通考》卷二——金不换髓歌\n',
		亥: '【金不换髓歌断】\n戊土亥提财杀真，身强有火更超群。\n逆行早岁须防酉，顺运中年忌卯辰。\n来源：《神峰通考》卷二——金不换髓歌\n'
	},
	己: {
		子: '【金不换髓歌断】\n己土子月用财星，有杀无官格局清。\n大怕柱身中太弱，顺行寅卯早凋零。\n来源：《神峰通考》卷二——金不换髓歌\n',
		丑: '【金不换髓歌断】\n己土丑月日干坚，四柱分明忌比肩。\n若有财宫并有杀，逆行大运福无边。\n来源：《神峰通考》卷二——金不换髓歌\n',
		寅: '【金不换髓歌断】\n己土卯月杀当权，逆运须知寿不坚。\n顺逆火乡无极妙，官星相会不周全。\n来源：《神峰通考》卷二——金不换髓歌\n',
		卯: '【金不换髓歌断】\n己土辰提杂气真，财官有气定超群。\n顺行运气尤当妙，逆运行时不十分。\n来源：《神峰通考》卷二——金不换髓歌\n',
		辰: '【金不换髓歌断】\n己土巳月身尤旺，印绶伤官格局清。\n身旺最宜财运遇，无财逆运亦相应。\n来源：《神峰通考》卷二——金不换髓歌\n',
		巳: '【金不换髓歌断】\n己土巳月身尤旺，印绶伤官格局清。\n身旺最宜财运遇，无财逆运亦相应。\n来源：《神峰通考》卷二——金不换髓歌\n',
		午: '【金不换髓歌断】\n己土午月本身强，建禄分明理更长。\n官杀轻时宜顺运，官轻逆运亦荣昌。\n来源：《神峰通考》卷二——金不换髓歌\n',
		未: '【金不换髓歌断】\n己土未月欣逢煞，刃杀相逢更妙哉。\n运气中年多发达，不拘顺逆称心怀。\n来源：《神峰通考》卷二——金不换髓歌\n',
		申: '【金不换髓歌断】\n己土申月用伤官，若是身轻必不安。\n所喜须宜行逆运，怕逢寅卯杀相干。\n来源：《神峰通考》卷二——金不换髓歌\n',
		酉: '【金不换髓歌断】\n己土八月辛金旺，若是身轻命不牢。\n旺喜顺行衰喜逆，无财无杀不为高。\n来源：《神峰通考》卷二——金不换髓歌\n',
		戌: '【金不换髓歌断】\n己土如逢九月天，财官两旺福无边。\n运行顺逆皆平稳，发达之时在壮年。\n来源：《神峰通考》卷二——金不换髓歌\n',
		亥: '【金不换髓歌断】\n亥提己土用财官，身旺财官总是欢。\n若是身柔欣顺运，东方难保寿平安。\n来源：《神峰通考》卷二——金不换髓歌\n'
	},
	庚: {
		子: '【金不换髓歌断】\n子月如逢庚日干，有财有杀始平安。\n西方不似东方运，午运如逢寿数完。\n来源：《神峰通考》卷二——金不换髓歌\n',
		丑: '【金不换髓歌断】\n庚金丑月有财官，格局分明杂气看。\n木火柱无终不美，东南运气遇为欢。\n来源：《神峰通考》卷二——金不换髓歌\n',
		寅: '【金不换髓歌断】\n庚金寅月日干微，上透天干命愈奇。\n逆运初年嫌子丑，顺行大运怕逢难。\n来源：《神峰通考》卷二——金不换髓歌\n',
		卯: '【金不换髓歌断】\n庚金生值仲春时，官煞如逢命始奇。\n但嫌四柱元神弱，顺运三句恐殒危。\n来源：《神峰通考》卷二——金不换髓歌\n',
		辰: '【金不换髓歌断】\n庚金三月土重重，更有财官福禄丰。\n逆运固知强顺运，中逢子地有灾凶。\n来源：《神峰通考》卷二——金不换髓歌\n',
		巳: '【金不换髓歌断】\n庚金四月杀星强，有制方知杀伏强。\n若是无根又无制，其人多有少年亡。\n来源：《神峰通考》卷二——金不换髓歌\n',
		午: '【金不换髓歌断】\n五月庚金喜有根，有根有水贵堪言。\n逆行大运宜东地，子字相逢总不然。\n来源：《神峰通考》卷二——金不换髓歌\n',
		未: '【金不换髓歌断】\n庚金未月土旺地，戊己土重命无过。\n若是土轻行逆运，康宁福寿沐恩波。\n来源：《神峰通考》卷二——金不换髓歌\n',
		申: '【金不换髓歌断】\n七月庚金金太刚，坐支若实亦平常。\n财官两旺宜行顺，财杀轻时逆运强。\n来源：《神峰通考》卷二——金不换髓歌\n',
		酉: '【金不换髓歌断】\n八月庚金用刃星，柱中有杀最相应。\n有财无杀纯金局，从革尤当显姓名。\n来源：《神峰通考》卷二——金不换髓歌\n',
		戌: '【金不换髓歌断】\n庚金九月喜逢财，杀透天干亦妙哉。\n顺命初年嫌子地，逆行离巽有凶灾。\n来源：《神峰通考》卷二——金不换髓歌\n',
		亥: '【金不换髓歌断】\n庚金十月日干衰，有土相逢亦妙哉。\n顺运必然强逆运，中年惟恐有危灾。\n来源：《神峰通考》卷二——金不换髓歌\n'
	},
	辛: {
		子: '【金不换髓歌断】\n子月辛金喜丙丁，若然无火亦平平。\n运行木火多通达，财杀多时喜逆行。\n来源：《神峰通考》卷二——金不换髓歌\n',
		丑: '【金不换髓歌断】\n辛金丑月宜丁火，戊己重重亦不妨。\n无火土多防寿夭，纵然不夭也平常。\n来源：《神峰通考》卷二——金不换髓歌\n',
		寅: '【金不换髓歌断】\n辛金寅月财官旺，大运不须喜逆行。\n若是无财行顺运，中年惟恐丧残生。\n来源：《神峰通考》卷二——金不换髓歌\n',
		卯: '【金不换髓歌断】\n卯月辛金如有杀，坐支有土更为奇。\n顺行逆转名多显，若到西方反不齐。\n来源：《神峰通考》卷二——金不换髓歌\n',
		辰: '【金不换髓歌断】\n辛金生于辰月中，有财有杀更和同。\n顺行逆运多通达，富贵荣华福寿崇。\n来源：《神峰通考》卷二——金不换髓歌\n',
		巳: '【金不换髓歌断】\n辛金巳月官星旺，伤食全无亦不过。\n逆行但妨官子否，顺行一路总蹉跎。\n来源：《神峰通考》卷二——金不换髓歌\n',
		午: '【金不换髓歌断】\n辛金午月杀当权，四柱根深逆顺坚。\n若是无根堪弃命，如行西运大屯难。\n来源：《神峰通考》卷二——金不换髓歌\n',
		未: '【金不换髓歌断】\n未月辛金杀印全，印多尤似有亏偏。\n逆行水运多通达，顺运初年略不然。\n来源：《神峰通考》卷二——金不换髓歌\n',
		申: '【金不换髓歌断】\n申月辛金金水清，伤官有杀最相应。\n坐支无酉方为妙，运入东南显姓名。\n来源：《神峰通考》卷二——金不换髓歌\n',
		酉: '【金不换髓歌断】\n辛金酉月日干强，财杀相逢更异常。\n逆运到头多发达，顺行水地未为良。\n来源：《神峰通考》卷二——金不换髓歌\n',
		戌: '【金不换髓歌断】\n戌月辛金煞印全，柱中有制福无边。\n逆行顺去俱无阻，巳地相逢总不然。\n来源：《神峰通考》卷二——金不换髓歌\n',
		亥: '【金不换髓歌断】\n辛金亥月若无官，水冷应知金太寒。\n若有官星又有杀，定应名姓到金鸾。\n来源：《神峰通考》卷二——金不换髓歌\n'
	},
	癸: {
		子: '【金不换髓歌断】\n癸水冬生值子提，财官重见最为奇。\n顺行喜到东南运，逆走西方亦不宜。\n来源：《神峰通考》卷二——金不换髓歌\n',
		丑: '【金不换髓歌断】\n癸水丑提为杂气，无财无印不堪推。\n顺行木火俱为妙，逆运西南寿不齐。\n来源：《神峰通考》卷二——金不换髓歌\n',
		寅: '【金不换髓歌断】\n癸水寅月木伤官，官杀重逢祸百端。\n北运不如南运好，若到申宫寿有干。\n来源：《神峰通考》卷二——金不换髓歌\n',
		卯: '【金不换髓歌断】\n癸水生来卯月中，无官无杀喜和同。\n顺行南地多清贵，恐入西方寿早终。\n来源：《神峰通考》卷二——金不换髓歌\n',
		辰: '【金不换髓歌断】\n癸水辰月喜逢财，杂气分明格美哉。\n若是无根身太弱，顺行南运必多灾。\n来源：《神峰通考》卷二——金不换髓歌\n',
		巳: '【金不换髓歌断】\n癸水巳提财更旺，官多不与杀相同。\n有根逆运多财足，顺入西方早见凶。\n来源：《神峰通考》卷二——金不换髓歌\n',
		午: '【金不换髓歌断】\n癸水生逢午月中，分明财杀格相同。\n无根运不行中地，弃水从财反有功。\n来源：《神峰通考》卷二——金不换髓歌\n',
		未: '【金不换髓歌断】\n癸水未月杀星强，有刃无官禄位昌。\n运入东方经制伏，定看名姓列朝堂。\n来源：《神峰通考》卷二——金不换髓歌\n',
		申: '【金不换髓歌断】\n癸水生来值孟秋，有财终不忌身柔。\n顺行北运尤为妙，若是无财反不周。\n来源：《神峰通考》卷二——金不换髓歌\n',
		酉: '【金不换髓歌断】\n癸水酉月印生身，有杀方为格局真。\n逆运须知强顺运，功名富贵又超群。\n来源：《神峰通考》卷二——金不换髓歌\n',
		戌: '【金不换髓歌断】\n戌月如逢癸日干，分明杂气用财官。\n运行木火多财禄，逆运初年寿有干。\n来源：《神峰通考》卷二——金不换髓歌\n',
		亥: '【金不换髓歌断】\n癸日生来亥月中，伤官水木总相同。\n逆行最妙南方运，顺走须知忌卯凶。\n来源：《神峰通考》卷二——金不换髓歌\n'
	},
	壬: {
		子: '【金不换髓歌断】\n壬子生逢子月天，无财无杀未周全。\n终身困苦多流落，纵到财乡亦枉然。\n来源：《神峰通考》卷二——金不换髓歌\n',
		丑: '【金不换髓歌断】\n壬水丑月喜逢财，财旺身强更妙哉。\n运气顺行经水火，堪为万事称心怀。\n来源：《神峰通考》卷二——金不换髓歌\n',
		寅: '【金不换髓歌断】\n壬水如逢寅月生，食神旺相亦相应。\n南方运气增财帛，有杀终须播姓名。\n来源：《神峰通考》卷二——金不换髓歌\n',
		卯: '【金不换髓歌断】\n壬逢卯月伤官格，逆行无如顺运高。\n杀透更加身旺处，功名富贵寿弥高。\n来源：《神峰通考》卷二——金不换髓歌\n',
		辰: '【金不换髓歌断】\n壬水辰月杀星强，甲乙相逢杀伏降。\n更得财星并印绶，不拘顺逆亦相当。\n来源：《神峰通考》卷二——金不换髓歌\n',
		巳: '【金不换髓歌断】\n壬水生逢夏月天，财星官杀旺堂前。\n无根只怕初年夭，若到中年福愈坚。\n来源：《神峰通考》卷二——金不换髓歌\n',
		午: '【金不换髓歌断】\n壬水午月财星旺，亥水相逢更异常。\n若是无根多弃命，平生白手置田庄。\n来源：《神峰通考》卷二——金不换髓歌\n',
		未: '【金不换髓歌断】\n壬水生逢季夏时，分明杂气异为奇。\n顺行逆转皆通达，卯地相逢总不宜。\n来源：《神峰通考》卷二——金不换髓歌\n',
		申: '【金不换髓歌断】\n壬水生身为杀印，有财有用亦相当。\n运行南地强如北，卯地相逢命不长。\n来源：《神峰通考》卷二——金不换髓歌\n',
		酉: '【金不换髓歌断】\n壬水相逢八月天，分明印绶格当权。\n无官怕入财乡运，有杀应须福愈坚。\n来源：《神峰通考》卷二——金不换髓歌\n',
		戌: '【金不换髓歌断】\n壬水生来值季秋，财多杀旺忌身柔。\n财居火地俱通达，遇木之乡返不周。\n来源：《神峰通考》卷二——金不换髓歌\n',
		亥: '【金不换髓歌断】\n壬水亥提为建禄，柱中有火运宜东。\n南方运气俱为美，若是无财亦不通。\n来源：《神峰通考》卷二——金不换髓歌\n'
	}
};

// 日干
export const SFTK_DAYGAN = {
	甲:
		'甲木诗曰 \n甲木天干作首排， 原无枝叶与根茎。 \n欲存天地千年久， 直向沙泥万丈埋。 \n成就不劳炎火锻， 资扶偏爱温泥佳。 \n断就栋梁金得用， 化成灰碳火为灾。 \n来源：《 神峰通考》 卷三—— 十天干体象全编论\n',
	乙:
		'乙木诗曰 \n乙木根茎种得深， 只宜阳地不宜阴。 \n漂浮最怕多逢水， 克断何须苦用金。 \n南去火炎灾不浅， 西行土重祸尤侵。 \n栋梁不是连根物， 辨别功夫好用心。 \n来源：《 神峰通考》 卷三—— 十天干体象全编论\n',
	丙:
		'丙火诗曰 \n丙火明明一太阳， 原从正大立纲常。 \n洪光不独窥千里， 巨魄尤能遍八荒。 \n出世肯为浮木子， 传生不作温泥娘。 \n江湖死水安能克， 惟怕成林木作殃。 \n来源：《 神峰通考》 卷三—— 十天干体象全编论\n',
	丁:
		'丁火诗曰 \n丁火其形一烛灯， 太阳相见夺光明。 \n得时能铸千金铁， 失令难熔一寸金。 \n虽少乾柴犹可用， 纵多湿木能不生。 \n其间衰旺当分晓， 旺比一炉衰一檠。 \n来源：《 神峰通考》 卷三—— 十天干体象全编论\n',
	戊:
		'戊土诗曰 \n戊土城墙堤岸同， 振河及海要根重。 \n柱中带合形还壮， 日下乘虚势心穷。 \n力薄不胜金漏泄， 功成安用水疏通。 \n平生最要东南健， 身旺东南健失中。 \n来源：《 神峰通考》 卷三—— 十天干体象全编论\n',
	己:
		'己土诗曰 \n己土田园属四维， 坤深为万物之基。 \n水金旺处身还弱， 火土功成局最奇。 \n失令岂能埋剑戟， 得时方可用磁基。 \n漫夸印旺兼多合， 不遇刑冲总不宜。 \n来源：《 神峰通考》 卷三—— 十天干体象全编论\n',
	庚:
		'庚金诗曰 \n庚金顽钝性偏刚， 火制功成怕火乡。 \n夏产东南遇锻炼， 秋生西北亦光芒。 \n水深反见他相克， 木旺能令我自伤。 \n戊己干支重遇土， 不逢冲破即埋藏。 \n来源：《 神峰通考》 卷三—— 十天干体象全编论\n',
	辛:
		'辛金诗曰 \n辛金珠玉性虚灵， 最爱阳和沙水清。 \n成就不劳炎火锻， 滋扶偏爱湿泥生。 \n木多火旺宜西北， 水冷金寒要丙丁。 \n坐禄通根身旺地， 何愁厚土没其形。 \n来源：《 神峰通考》 卷三—— 十天干体象全编论\n',
	壬:
		'壬水诗曰 \n壬水汪洋并百川， 漫流天下总无边。 \n干支多聚成漂荡， 火土重逢伤本原。 \n养性结胎须未午， 长生归禄属乾坤。 \n身强原自无财禄， 西北行程厄少年。 \n来源：《 神峰通考》 卷三—— 十天干体象全编论 ',
	癸:
		'癸水诗曰 \n癸水应为雨露麽， 根通亥子即江河。 \n柱无坤坎还身弱， 局有财官不尚多。 \n申子辰全成上路， 午寅戌备要中和。 \n假饶火土生深夏， 西北行程岂太过。 \n来源：《 神峰通考》 卷三—— 十天干体象全编论 '
};

// 月支
export const SFTK_MONTHZHI = {
	子:
		'子宫诗曰\n月支子水占魁名，溪涧汪洋不尽情。天道阳回行土旺，人间水暖寄金生。若逢午破应无定，纵遇卯刑还有情。柱内申辰来合局，即成江海发涛声。\n来源：《神峰通考》卷三——十二支咏\n',
	丑:
		'丑宫诗曰\n隆冬建丑怯冰霜，谁识天时转二阳。暖生城能生万物，寒金难道只深藏。刑冲戌未非无用，类聚鸡蛇信有方。若在日时多水木，直须行入巽离乡。\n来源：《神峰通考》卷三——十二支咏\n',
	寅:
		'寅宫诗曰\n艮宫之木建于春，气聚三阳火在寅。志合蛇猴三贵客，类同卯未一家人。超凡入圣惟逢午，破禄伤提独虑申。四柱火多嫌火地，从来燥木不南奔。\n来源：《神峰通考》卷三——十二支咏\n',
	卯:
		'卯宫诗曰\n卯木繁华气禀深，仲春难道不嫌金。庚辛叠见愁申酉，亥子重来忌癸壬。祸见六冲应落叶，喜逢三合便成林。若归时日秋金重，更向西行患不禁。\n来源：《神峰通考》卷三——十二支咏\n',
	辰:
		'辰宫诗曰\n辰当三月水泥湿，长养堪培万物根。虽是甲衰乙余气，纵然壬墓癸遇魂。直须一钥能开库，若遇三冲即破门。水土重逢西北运，只愁厚土不能存。\n来源：《神峰通考》卷三——十二支咏\n',
	巳:
		'巳宫诗曰\n巳当初夏火增光，造化流行正六阳。失令庚金生赖母，得时戊土禄随娘。三刑传送翻无害，一见登明便有伤。行到东南生发地，烧天炎焰不寻常。\n来源：《神峰通考》卷三——十二支咏\n',
	午:
		'午宫诗曰\n五月炎炎火正升，六阳气逐一阴生。庚金失位身无用，己土归垣禄有成。\n申子齐来能战克，戌寅同见越光明。东南正是身强地，西北休囚巳丧形。\n来源：《神峰通考》卷三——十二支咏\n',
	未:
		'未宫诗曰\n未月阴深火渐衰，藏官藏印不藏财。近无卯亥形难变，远带刑冲库亦开。\n无火怕行金水去，多寒偏爱丙丁来。用神喜忌当分晓，莫把圭璋作石猜。\n来源：《神峰通考》卷三——十二支咏\n',
	申:
		'申宫诗曰\n申金刚健月支逢，水土长生在此宫。巳午炉中成剑戟，子辰局里得光锋。木多无火终能胜，土重埋金却有凶。欲识斯神何所似，温柔珠玉不相同。\n来源：《神峰通考》卷三——十二支咏\n',
	酉:
		'酉宫诗曰\n八月从魁已得名，羡他金白水流清。火多东去愁寅卯，木旺南行怕丙丁。柱见水泥应有用，运临西北岂无情。假饶三合能坚锐，不比顽金未炼成。\n来源：《神峰通考》卷三——十二支咏\n',
	戌:
		'戌宫诗曰\n九月从魁性最刚，漫云于此物收藏。洪炉巨火能成就，钝铁顽金赖主张。海窟冲龙生雨露，山头合虎动文章。天罗虽是迷魂阵，火命逢之独有伤。\n来源：《神峰通考》卷三——十二支咏\n',
	亥:
		'亥宫诗曰\n登明之位水源深，雨雪生寒值六阴。须待胜光方用土，不逢传送浪多金。五湖归聚源成象，三合羁留正有心。欲识乾坤和暖处，即从艮震巽离寻。\n来源：《神峰通考》卷三——十二支咏\n'
};
