// 日柱
export const TYWX_DAY = {
	甲子: '古诗: 生于子偏宜冬降。 \n今译: 喜生冬季， 文人之所喜， 调候需火， 此即是月时印格一生清高。 ',
	甲寅: '古诗: 木旺兮生居寅位。 \n今译: 自坐禄临官， 乃是有主见之人。 须有财官旺支。 ',
	甲辰: '古诗: 居辰也性柔而厚仁。 \n今译: 辰乃印库， 性柔和而得实权。 如生夏月， 火炙乘龙。 ',
	甲午: '古诗: 育于午夏降家殷。 \n今译: 夏生一生有财， 调候需水。 ',
	甲申: '古诗: 气衰兮为降于申。 \n今译: 坐绝， 天元坐杀， 需见丙丁。 ',
	甲戌: '古诗: 在戌火楚而怀善。 \n今译: 自坐丁火伤官之库， 不易生财， 也是自坐空亡， 但为人人寿。 ',
	乙丑: '古诗: 坐于丑畏产西方。 \n今译: 大忌秋生， 因为自坐杀库。 ',
	乙卯: '古诗: 临卯也支藏重禄。 \n今译: 乙禄在卯是阴禄。 一切所得出于意外。 弱阳禄， 甲禄在寅， 一切所得是意料之中。 ',
	乙巳: '古诗: 育于巳宜从金化。 \n今译: 自坐巳财火土和用之财， 也是金长生巳， 若见乙庚和， 即是火土金全和， 财官合。 ',
	乙未: '古诗: 在未也阴木正乡。 \n今译: 自坐乙木之墓， 只坐身旺论。 ',
	乙酉: '古诗: 值于酉无化而肢体须伤。 \n今译: 自坐绝（ 杀旺）， 最忌酉辛出干， 主身体差。 ',
	乙亥: '古诗: 居于亥虽衰而不失局。 \n今译: 亥支以亥卯未而论， 即使是亥子丑， 也是水生木， 作自生自旺论。 ',
	丙子:
		'古诗: 在于子，有化非俗。 \n今译: 有化非俗（ 丙辛和水， 只要月日时有亥子， 皆为真化）。 天干和化， 在仿本有三种习用的方式。 1. 合化要得令， 即丙辛合水， 要生在冬季。 2. 合化要见辰字， 即是逢龙则化， 不计较于哪一个月令。 3. 与1类似， 但不拘于月令， 月日时支， 只要与合化五行相同即可。 只要是真化即是从吉而论。 ',
	丙寅: '古诗: 临寅有秀，不贵则必长年。 \n今译: 丙长生在寅， 此长生也可以视为当事人之长生。 ',
	丙辰:
		'古诗: 长在辰宫，失地利，愁逢冬降。 \n今译: 忌生于冬。 1. 合化忌见双试， 诸如： 逢龙则化， 有辰即化， 不需要再取丙辛， 必须冬日再化。 2. 若丙辛合化， 生于子月， 则地支不宜再有亥子之字。 3. 月支归日库， 地支四柱自行归库， 地支有一支子（ 癸）， 则不宜见辰支。 以癸水归辰库， 若一柱归领一库， 则等同墓库运。 此一入库之支， 15 年限皆作废。 ',
	丙午: '古诗: 值午象明有礼，终须显禄。 \n今译: 帝旺身强， 丙主礼， 此造成败皆在一个礼字。 ',
	丙申: '古诗: 居于申，畏怕秋生。 \n今译: 最怕秋生由忌酉月， 火不西奔。 丙和酉中辛财， 辛出干为人一生软弱。 ',
	丙戌: '古诗: 生居戌位，得阳和春，至舒苏。 \n今译: 得阳合， 春至舒畅， 自坐火库戌， 不愁水盛。 ',
	丁丑: '古诗: 临丑上畏怕冬生。 \n今译: 最忌冬生， 会亥子丑， 又透水， 丁日主之大忌。 ',
	丁卯: '古诗: 长向大冲不化兮，愁逢癸水。 \n今译: 天干若不是丁壬合， 则大忌冬生见癸水。 ',
	丁巳: '古诗: 值巳也财旺富足。 \n今译: 是指坐禄， 只要四柱有财旺之支， 庚申辛酉， 即是富命。 女命大忌丁巳日夫绝。 ',
	丁未: '古诗: 生于小吉进成兮，为有明丁。 \n今译: 自坐透丁， 只需财官之支。 ',
	丁酉: '古诗: 居酉地干和而显贵。 \n今译: 自坐偏财， 天干不可有克， 有和。 ',
	丁亥: '古诗: 在亥也有犯而名升。 \n今译: 春夏吉， 冬生者否。 ',
	戊子: '古诗: 居于子有化名迁。 \n今译: 子即是癸， 干支自合， 生于巳午月， 即是佳命。 此经兼取天干地支自合， 遍及于四支。 ',
	戊寅: '古诗: 春生寅位亦恐灾愆。 \n今译: 此是指甲之通根， 克土力强主凶。 远比甲木梳土为重要。 ',
	戊辰: '古诗: 生居辰自居正位。 \n今译: 自坐转位亦主吉祥。 ',
	戊午: '古诗: 临午也时通发旺。 \n今译: 是戊日主旺位， 四支有一个午支印， 大利于时支（ 在时支最好） 即是自信之善命。 ',
	戊申: '古诗: 秋降临申文学辨博。 \n今译: 此节即是戊土长生在申， 水土同长生， 即是文才之命。 ',
	戊戌: '古诗: 育于戌一世坚完。 \n今译: 辰戌皆是日主之本气位， 此经明显以自坐生旺库， 只要不见冲刑， 不必格局， 也是自信之命。 ',
	己丑: '古诗: 临丑也自居正位。 \n今译: 自居正位， 日主自坐丑禄， 只要有财官贵人， 即是佳命。  \n',
	己卯: '古诗: 居卯也聪明智辨。 \n今译: 天元坐杀， 为人聪明， 猜忌。 ',
	己巳: '古诗: 在巳也足信多财。 \n今译: 忠信多财， 土主信， 己日最喜丙， 丙禄在巳， 故曰忠信多财。 ',
	己未: '古诗: 逢未也只恐时衰。 \n今译: 未是己之禄， 若时支为甲子， 木旺支位， 寅卯， 恐晚年不吉。 ',
	己酉: '古诗: 育于酉有化除灾。 \n今译: 有化除灾， 天干令有甲， 甲己和化者反为吉。 ',
	己亥: '古诗: 值于亥从天建旺。 \n今译: 己喜甲丙， 亥中有甲， 但能明见天干， 即甲有根， 可从吉论。 ',
	庚子:
		'古诗: 值于子，逢滋助至迈无忧。 \n今译: 滋助， 1. 此节以丁己为滋助， 是取日主之喜神， 庚不离丁。 2. 他节取秀， 有财官贵人旺禄之支。 ',
	庚寅: '古诗: 居寅也衰中有喜。 \n今译: 寅即是甲， 食神论偏财， 虽然庚绝在寅， 有日干喜用亦不为忌， 但庚以丁甲为第一于第二喜用。 ',
	庚辰: '古诗: 临辰须凭时引。 \n今译: 辰是水库， 也是逢龙则化， 最佳是乙酉时， 其次是甲日寅时。 ',
	庚午: '古诗: 生于午，虽困而终藏言吉。 \n今译: 庚怕巳， 较不忌午。 庚金怕强火， 火旺在午， 但午中有丁， 却是日主之所喜。 ',
	庚申: '古诗: 逢申也福寿应酬。 \n今译: 凡四柱日禄，（ 申） 只要有秀即是佳命。 秀， 财官印有根。 ',
	庚戌: '古诗: 离戌也月克遭囚。 \n今译: 月克透凶， 大抵辰戌地支最忌有冲。 尤其是在月日， 此乃人生最重要之三十至四十五岁。 ',
	辛丑: '古诗: 丑中本位有助，金无破散。 \n今译: 自坐劫库， 不利长亲。 ',
	辛卯: '古诗: 居卯则败中有助。 \n今译: 自坐绝处， 却是偏财 ',
	辛巳: '古诗: 在巳则死内逢局。 \n今译: 巳即是丙， 若巳午未， 反坐佳命。 ',
	辛未: '古诗: 未地逢衰，应鲜获福。 \n今译: 未中有乙丁， 火制辛金。 ',
	辛酉: '古诗: 酉中逢禄，自坐旺乡。 \n今译: 坐禄身旺有寿。 ',
	辛亥: '古诗: 亥中沐浴，失时也，终是驱驰。 \n今译: 官杀坐绝不论男女皆无助益。 ',
	壬子: '古诗: 临子也旺水滔滔。 \n今译: 羊刃大忌申子辰， 透壬癸。 ',
	壬寅: '古诗: 在寅也必须既济。 \n今译: 此是以易经中水火既济， 壬水必须以丙巳午为第一优先， 地支寅午戌由佳。 ',
	壬辰: '古诗: 居辰则福禄多招。 \n今译: 自坐劫财， 亦为魁罡， 足智多谋， 大忌冲克。 ',
	壬午: '古诗: 育于午时巧家豪。 \n今译: 自坐财官， 再见午时， 一生皆吉， 午除了财重， 亦作调候看。 ',
	壬申: '古诗: 值申则学堂显赫。 \n今译: 自坐长生， 即是长寿， 论， 只要时柱不冲， 不见戊， 即是佳命。 ',
	壬戌:
		'古诗: 生于戌凶中有吉。 \n今译: 凶是指戊土， 吉是指火库。 故此， 透戊则凶， 天干不透戊透丙丁则吉。 若天干戊丙丁皆透， 则吉凶并见， 但引时支为最终答案。 ',
	癸丑: '古诗: 值丑也时巧无疑。 \n今译: 丑是水余气， 若时支也是亥子丑， 则为人机巧。 ',
	癸卯: '古诗: 坐于卯学堂建旺。 \n今译: 乙是日主喜神， 但只主才学。 ',
	癸巳: '古诗: 守于巳变火为祥。 \n今译: 坐巳火为财， 但天干须有丙或戊。 ',
	癸未: '古诗: 临未则略应返朴。 \n今译: 火之余气， 小有成就。 ',
	癸酉: '古诗: 居酉也宜通月气。 \n今译: 生于秋， 天干有庚辛者， 大吉（ 喜庚辛）。 '
};

// 日干+时支
export const TYWX_DAYGAN_TIMEZHI = {
	甲: {
		子: '古诗: 在于子通德秀，官居极品。\n今译: 有天月德贵人， 通根于月柱， 主有权贵之人。 ',
		丑: '古诗: 在丑也家财必损。\n今译: 劫财丧妻败财， 坐辛正官之库丑， 有权无名， 晚年有损财之忧。 ',
		寅: '古诗: 引至功曹不贵，而家必殷富。\n今译: 月柱有财官者， 巳午申酉， 家财富有。 ',
		卯: '古诗: 长在卯乡，纵贵而难承祖荫。\n今译: 时上羊刃， 即是是佳命（ 羊刃驾杀）， 也是无祖业与妨妻之命。 ',
		辰: '时上偏财，坐印库，须生于夏季，即为得辰之调候，佳命。',
		巳: '古诗: 合巳也作事多淳。\n今译: 天干甲己合财， 晚年财虽旺， 因合而散， 心地醇厚。 ',
		午: '古诗: 值午也祖业难存。\n今译: 甲子日， 庚午时， 日时对冲， 七杀生财。 晚年自力更生， 一生辛劳有结果。 ',
		未: '古诗: 生临遇未，象成而有明辛。\n今译: 正官坐天乙贵人， 晚年大吉。 ',
		申: '古诗: 生居传送图名，而劳役辛勤。\n今译: 时柱杀印同根在申， 另透七杀， 杀印相生者吉。 ',
		酉: '古诗: 从魁喜遇声名兮，富贵超群。\n今译: 生于秋季， 为官印双清。 生于其它月支， 晚年清秀之名士。 ',
		戌: '古诗: 临于戌失月气，难保双亲。\n今译: 亦是生于戌月， 四见伤官入库， 自由无依。 ',
		亥: '古诗: 时有登明虽秀，蟾宫怎折桂枝。\n今译: 乙坐亥中比肩， 一生不宜从事名利之事。 '
	},
	乙: {
		子: '子印克丙食，主一生劳碌，体弱。',
		丑: '古诗: 在丑从金德化也，终身贵显。\n今译: 丑为杀库， 有乙庚和者， 晚年有成。 ',
		寅: '古诗: 若长于寅虽建旺亦多成败。\n今译: 寅子劫财正财同根透干， 随有成， 内有败之根， 反复不定。 ',
		卯: '古诗: 至卯也一世荣昌。\n今译: 乙禄在卯， 用偏财晚年大吉。 ',
		辰: '古诗: 时至龙宫见学堂，朝廷显贵。\n今译: 庚辰时， 只要四柱有乙， 即是真化， 必有贵人相助。 ',
		巳: '古诗: 居巳也自身无气。\n今译: 春生寅卯月巳是财旺位。 如果不是春生则非。 ',
		午: '古诗: 或逢午位，德秀有气，金榜名张。\n今译: 自坐财官只要不见冲刑即是吉命。 ',
		未: '古诗: 育于未妻必多妨。\n今译: 土旺在未， 也是乙之库， 乙木以土为妻， 时坐妻库， 妻多。 ',
		申: '古诗: 生居传送，得地利，紫绶金章。\n今译: 地支成水局， 天干无土者， 水木两局， 贵命。（ 女命则否） ',
		酉: '古诗: 生于酉地人之化用。\n今译: 坐绝逢绝， 即使如从杀， 也防体弱。 ',
		戌: '古诗: 畏居戌位见金早岁身亡。\n今译: 时柱食伤入库， 大忌庚辛官杀局， 入库之食伤， 无法制杀。 若天干透金入局， 主体弱。 ',
		亥: '古诗: 生逢遇子奇贵也，劳苦身亡。\n今译: 干支双和， 亥是壬， 晚年守成。 '
	},
	丙: {
		子: '古诗: 居于子，威权亦显。\n今译: 干支和， 戊和子中之癸。 阳日主， 食神和正官。 ',
		丑:
			'古诗: 临丑也，福禄难图。\n今译: 己伤官坐丑， 丑中辛为财库， 辛金归丑库， 丑中己成伤官格， 大凡伤官生财， 最忌所生之财为入库之财， 难以有现成之福， 守财而已。 ',
		寅:
			'古诗: 时至长生，通月气，科名显赫。\n今译: 有秀不贵， 则也必长年。 有秀是指（ 财， 官， 印， 贵人， 长生， 禄， 旺） 只要有一项， 即是秀。 即使庚偏财坐绝于寅， 但寅是丙的长生， 扔做有寿论。 ',
		卯: '古诗: 值于卯，从化财虚。\n今译: 从财虚化。 日主丙， 丙辛和儿不化， 只要支没有酉字， 也可以有虚场面。 ',
		辰:
			'古诗: 长生天罡不化兮，双亲难靠。\n今译: 水多目疾。（ 古人皆以水克火， 伤目） 亦无长亲。 若以十神而言， 壬七杀入辰水库， 有职无权。 ',
		巳: '古诗: 在巳也，得旺相，多招福禄。\n今译: 癸是正官， 时支巳即是日主之禄。 只要其它支有癸官之旺支亥子， 即是招得吉祥。 ',
		午: '古诗: 在午也，财多蓄聚。\n今译: 丙财旺在申， 申中戊土生庚财， 有申即富。 ',
		未: '古诗: 育于未，夏生兮，佩印双鱼。\n今译: 生于夏季， 最宜有水木两局。 佩印指木， 双鱼指两局。 ',
		申: '古诗: 生居申，冬降也，返成厚福。\n今译: 经曰， 火不西奔， 生于申酉， 又生酉时。 财合多， 一生有财不聚， 亦无辖妻之权。 ',
		酉:
			'古诗: 引居死地，失时运，耄岁驱驰。\n今译: 时支酉辛， 是丙之正财， 丙辛和财， 皆作一生难聚。 五阳干， 皆是和财， 五者之中， 最忌丙辛和。 ',
		戌:
			'古诗: 河魁喜遇象盛，而旺发宁宫。\n今译: 生于巳午月， 火土为命法之忌。 曰， 火炎土燥。 唯一可作吉论者， 即是生于巳午月。 若生于其它月支， 为火炎土燥， 平常人。 ',
		亥: '古诗: 临亥也，不成真水，有水如无。\n今译: 真水即是亥子丑透壬癸， 成七杀格大吉。 否则时干己伤官为伤官见官， 一事无成。 '
	},
	丁: {
		子: '古诗: 生居坎位身衰也，祖业难成。\n今译: 时柱是日主之绝， 日禄归绝者， 大抵不托祖业。 至于自身之吉凶， 是依据财官调候而论。 ',
		丑: '古诗: 逢丑也财多有气。\n今译: 辛丑是偏财坐财库， 主有财。 此经以生旺库视同相同之能量， 皆旺论。 ',
		寅:
			'古诗: 在寅也明官有旺。\n今译: 丁以甲为第一优先之喜神， 寅即是甲， 又以时代不同， 行文术语不同。 此经之明宫， 不是指正官， 而是指一般性之官禄名位而已， 也即是指丁日寅时， 用神在时支， 必有官禄财势。 ',
		卯:
			'古诗: 引到卯乡夫灾子寡。\n今译: 标准十神论命， 以女命为主， 卯是丁的偏印禄位， 以偏印克食伤， 在六亲而言， 女命即是克子， 晚年无子女缘。 若男女同论偏印， 是艺术性格， 在时支， 人到了晚年仍然不务实， 并不是很理想的事， 为人孤独， 人员薄， 最易宗教。 若以格局论即是时支偏印， 但偏印在时支， 已经没有时支以后的柱了， 因此也不成其用。 故此不论是夫灾子寡， 还是妻灾友寡， 大抵都是近似之答案。 此说适用于十天干（ 甲日亥时， 乙日子时， 丙日寅时， 丁日卯时， 戊日巳时， 己日午时， 庚日巳时， 辛日午时， 壬日申时， 癸日酉时。） 即使是兼财官用神， 有所不同， 那只是有财有异， 亲 ',
		辰:
			'古诗: 宜逢春暮有秀也，耄岁才兴。\n今译: 秀不是指坐旺之秀气， 而是指秀出， 是指有财官印贵人之旺支。 丁日有甲时干， 已是吉祥， 若丁壬合， 见辰， 即是逢龙则化。 唯因为在时柱， 只有老了才会兴旺。 ',
		巳:
			'古诗: 遇巳土木火鲜明。\n今译: 多有明暗之财， 丁壬合木， 为化气五行， 木见巳为食伤生财。 禄命法的化气五行并不十分周详， 只能有此一说而论。 ',
		午:
			'古诗: 时至离宫带禄也，终身显贵。\n今译: 1. 有禄气入格吉， 即是另有旺支财官入格。 2. 通月气贵， 指生巳午月， 乃全火局而论。 此经有轻年柱之立场， 重化气同行于四支， 以及财官， 仅做参考。 ',
		未:
			'古诗: 居于未地，虽旺也愁逢冬降。\n今译: 未中有日时天干， 此为日时自旺， 可以形成1.四柱皆丁未， 2 年月亦成同种五行， 则成从格。 3. 亦可以用财官印贵人旺支。 若不见冲刑不成局之冬生， 皆可从吉论。 ',
		申: '古诗: 怕长申秋见损也，财多聚散。\n今译: 不喜秋， 生于申酉时， 也就是月时皆为金旺之支， 财多聚散。 ',
		酉: '古诗: 生居酉位，带学堂金榜张名。\n今译: 酉为从魁， 论命需要慎重， 时支七杀坐禄， 晚年守财。 ',
		戌: '古诗: 值于戌，自败上有明庚。\n今译: 自败， 戌上有庚， 庚克甲之喜用， 曰， 天败。 ',
		亥: '古诗: 居亥也暗印相迎。\n今译: 官印相生， 四柱需明见甲。 '
	},
	戊: {
		子: '古诗: 育于子足禄多坚。\n今译: 正偏财自坐旺， 必主有财之命。 ',
		丑: '古诗: 值丑也，别道田园。\n今译: 丑是己土， 戊日主忌甲旺， 有丑中之己土和甲， 时干癸合戊。 主意外得财。（ 正财， 偏财俱可） ',
		寅:
			'古诗: 居寅有克见财，而一生返覆。\n今译: 戊土， 四柱无甲， 则是无木梳土。 但忌见旺甲（ 甲寅）， 反受重克， 主一生多变， 反复无常， 依七杀之性质为主。 ',
		卯: '古诗: 长生卯乡有旺也，官迁两府。\n今译: 官旺之支， 只要月令有辰戌丑未巳午， 能有一支透干， 即做有权职之命。 ',
		辰: '古诗: 引至天罡双亲难依。\n今译: 辰是戊日主比劫旺根， 不利长亲。 ',
		巳: '古诗: 太乙忻逢时居建旺。\n今译: 巳也就是印的旺支， 既可以视为善命。 ',
		午: '古诗: 生于午虽明怎辨。\n今译: 火土双旺之支。 但在时支， 无任何格局可依， 唯论吉祥， 守成有于。 ',
		未: '古诗: 临未也，双亲必失。\n今译: 未做己土论， 等同时支座比劫旺根。 主难以得到长上福气， 自身却是有志气， 才情之人士。 ',
		申: '今译: 食神明旺，吉祥之命。',
		酉: '古诗: 从魁怕遇，福禄须悭。\n今译: 晚年辛酉时， 食伤可以生财， 伤官生财者主人坚守。 ',
		戌:
			'古诗: 河魁喜逢福土秋天。\n今译: 河魁是戌， 喜秋生， 申金透壬， 食伤生财格。 戌是戊日主之专位， 相当于月禄归时， 他柱只要有财官坐禄之地支， 即可托福之命。 ',
		亥: '古诗: 在亥逢兴遇合，而福绵绵。\n今译: 戊和癸时干， 地支是财， 坐富命而论。 '
	},
	己: {
		子: '古诗: 还居神后不贵而金玉升阶。\n今译: 癸是偏财， 甲是喜神和日主， 无丙也能论富命。 ',
		丑: '古诗: 丑中遇败见克而难保家财。\n今译: 己日主最忌见乙， 故曰晚年不保。 ',
		寅: '古诗: 长在寅方显富也象成火土。\n今译: 己日主， 丙是第一用神， 甲是第二用神。 ',
		卯:
			'古诗: 引至太冲虽秀也科名亦失。\n今译: 秀指卯是己的官杀， 大凡时柱七杀入根者， 大抵皆为虚名。 时支七杀坐旺包括， 月日时支三合拱七杀格， 皆为虚福。 ',
		辰: '古诗: 引至辰乡自旺也双亲少靠。\n今译: 辰是己日主比劫之根， 依例做不利长亲。 \n',
		巳: '古诗: 在巳身衰得月气蟾宫折桂。\n今译: 不做金神论， 但以巳做火印看， 月令有辰戌丑未者， 何以近贵人有权。 己日喜甲丙 ',
		午:
			'古诗: 午宫若旺有天禄位至三台。\n今译: 天禄指喜用， 并没有固定之干支， 己日主第一优先丙甲， 四柱另有丙甲出干， 坐旺者， 即是有权之命 ',
		未: '古诗: 值未时与有倚托官居显职。\n今译: 己第二所喜是辛， 辛食神是和平之福。 ',
		申: '古诗: 生居申位失天时终损形骸。\n今译: 己日主第二忌神壬庚两字全， 若生于辰戌丑未时， 仍为常人。 若不是此月当令则身体不佳。 ',
		酉: '古诗: 值酉逢衰见财必应聚散。\n今译: 食神生财必须生于辰戌丑未月， 需身旺。 ',
		戌: '古诗: 时居戌位身遭父母多灾。\n今译: 即是时支坐比劫之重述。 ',
		亥: '古诗: 亥中建旺空明兮贵气沉埋。\n今译: 亥是壬甲， 甲是喜神。 但乙是第一忌神。 '
	},
	庚: {
		子: '古诗: 居于子，自无气，轗轲难遂。\n今译: 庚日不喜丙， 冬月例外， 时支癸伤官， 无法生财， 故曰， 难逐。 ',
		丑: '古诗: 生于丑，财丰有劫。\n今译: 重点不在于丑贵人， 而是在丁天干， 大忌癸水藏于丑。 ',
		寅: '古诗: 降于寅，刚挫于柔。\n今译: 戊寅另透甲， 即是第二用神偏财。 不透甲， 透戊则须待晚年始有见福。 ',
		卯:
			'古诗: 居于太冲，失月气，因妻显旺。\n今译: 卯是乙正财， 生于寅卯月， 一生吉祥。 非生于寅卯月， 晚年得妻之助力， 为人谨慎， 无偏财之禄。 ',
		辰: '古诗: 临辰也，喜降秋生。\n今译: 尤其乙酉月， 乃双和六合， 逢龙则化。 ',
		巳: '古诗: 在巳也，遐龄寿考。\n今译: 此经以时支坐日主之长生位， 主有寿。 ',
		午:
			'古诗: 居于午上，得天时，自己封侯。\n今译: 午时定， 喜神之旺位， 只要不是庚子日定主吉祥。 喜用随佳也得得日主月上申之旺位， 否则亦无大福。 ',
		未:
			'古诗: 育于小吉，守门户，立子优游。\n今译: 未是天乙贵人， 也是正财之库。 依托， 1. 月令是申或有根。 2. 未贵人有依托， 不可见冲刑贵人， 忌冲刑。 3. 未中之乙财， 出天干为有依托。 ',
		申: '古诗: 长到申宫，有气也，终身显贵。\n今译: 四柱无寅， 甲之根， 晚年虚富。 ',
		酉:
			'古诗: 酉中马旺为师令，统摄十州。\n今译: 最佳是庚辰日， 日时双合， 也是逢龙则化。 月年有辰支， 但取逢龙则化。 时支羊刃， 有秀者， 晚年大成。 ',
		戌: '古诗: 戌地禄轻，长年箪瓢陋巷。\n今译: 日主喜丁， 但忌丁火归戌库。 丙字对庚而言， 除非生于冬月， 则是列入忌神。 ',
		亥: '古诗: 育于亥，逢丁助，时事易求。\n今译: 大忌亥子丑和局透壬。 不透甲， 也没有午字， 不见冲刑亦吉。 '
	},
	辛: {
		子:
			'古诗: 逢坎位，忻然干刑而亦作名儒。\n今译: 天干克地支， 干刑。 辛日主天干用壬， 地支亥子可以通用。 用神纵有刑克， 无富贵， 也可以主名儒。 ',
		丑: '古诗: 临丑也，财散家虚。\n今译: 丑是辛金劫财支库， 己丑乃比肩劫库。 辛金最忌见己丑， 十干通用。 ',
		寅: '古诗: 若到寅方有秀，官居极品。\n今译: 时支正财当令， 只要甲丙出天干， 以及月令带辛之根。 佳命， 财官贵人之根。 ',
		卯: '古诗: 在卯也，三妻可立。\n今译: 此十干相同之结论， 多妻， 亦多散财， 即是比劫坐财之旺位（ 十天干日时皆同论） ',
		辰: '古诗: 逢辰破象，壬败而反复无倚。\n今译: 辰逢龙则化， 丁壬合， 但丁辛克， 故合中带克， 反主败。 ',
		巳: '古诗: 太乙忻逢干助也，科名必显。\n今译: 巳中戊正印， 丙正官， 戊土生辛金， 丙火合辛金， 故曰干助， 主吉， 只主文名， 并非富贵。 ',
		午: '古诗: 畏到离宫，朝贵也，必通月气。\n今译: 午时天乙贵人， 不宜透出丙。 ',
		未: '古诗: 值于未乡，双亲少靠。\n今译: 偏财坐库， 十干通论。 偏财坐库这皆自立而成， 难考双亲。 ',
		申: '古诗: 宜居申位，得天时，位至中书。\n今译: 辛日见丙， 丙辛合， 但能生于秋冬便是吉命。 辛金和丙是和官， 地支辰亦可。 ',
		酉: '日禄归时，丁和壬水，日主健康长寿。',
		戌: '古诗: 育于戌位，必先克祖。\n今译: 戊戌， 克壬水调候， 戌是丁库， 亦合壬水调候。 故此， 戊戌与壬调候克和交集， 大不利先天之行运。 ',
		亥: '古诗: 登明怕遇，失月气，奴下之流。\n今译: 月支没有申酉， 泄身太过， 壬又是调候， 因机遇而从他人之势。 '
	},
	壬: {
		子: '古诗: 神后还遇冬降也，己身健旺。\n今译: 此经日禄归时， 以及时上比劫旺， 羊刃， 皆为有志之人。 若是冬生才智超人。 ',
		丑: '古诗: 丑中身旺无化也，性僻强徒。\n今译: 正印坐库， 乃坚持己见之人，（ 辛丑日亦见同论） 若丙辛和化见辰， 或冬生者， 皆作佳命。 ',
		寅: '古诗: 寅上财乡有气也，必须骤发。\n今译: 寅是丙偏财之旺位， 生于春曰有气。 骤发指成就很快， 十干偏财在时支皆作晚年吉祥。 ',
		卯: '食神专位，不冲者，安慰和睦之命。',
		辰: '古诗: 生逢辰位坐禄兮，朝野之官。\n今译: 辰是土库， 壬用土不用天干， 只用地支辰戌丑未巳午， 以上皆为壬日主用神所在。 ',
		巳: '古诗: 在巳，刑身见败也，家财必损。\n今译: 若生于冬月， 纵然巳是丙戊， 也难有贵气。 ',
		午: '古诗: 胜光若值夏兮，道路迢迢。\n今译: 丙午是壬之喜神兼用神， 生于夏季， 一生有财。 ',
		未: '古诗: 未申，造旺有化，福禄坚牢。\n今译: 丁壬合化木入未库。 其他经文没有化墓库之说。 此指晚年有福。 ',
		申: '古诗: 生居传送，失天时，贵气难高。\n今译: 壬忌土水同根， 大忌申中之戊土出干， 一生吉凶不定。 ',
		酉: '古诗: 喜到从魁，官旺也，宜通月气。\n今译: 酉是辛正印， 最喜成申酉戌， 不忌见土， 有金局则化转。 ',
		戌: '古诗: 长在戌乡，见庚也，财多聚散。\n今译: 戌是金余气， 庚戌乃金印之局。 戌也是壬日主之财库， 财库见庚， 化财为印， 好虚名。 ',
		亥: '古诗: 引至登明，通德秀，科名显赫。\n今译: 亥是壬日主之禄， 正印坐禄， 指有才名。 '
	},
	癸: {
		子: '古诗: 生逢坎位带禄兮，四海名张。\n今译: 水主智， 晚年有才名。 ',
		丑: '古诗: 丑中隐鬼无气也，妻妾多妨。\n今译: 比肩坐比肩， 必主妨妻。 ',
		寅: '古诗: 长在寅方见损也，必应聚散。\n今译: 透丙为财， 若透甲戊， 则财亦不聚。 ',
		卯: '古诗: 时到太冲有秀也，象成水土。\n今译: 只主安稳。 ',
		辰: '古诗: 临辰则多反复。\n今译: 日主归辰库， 必有隐藏心思。 ',
		巳: '古诗: 居巳也一世荣昌。\n今译: 巳是金长生， 以十神言， 则是财旺， 喜用与财相合， 大吉。 ',
		午: '古诗: 喜到离宫象成兮，簪缨冠带。\n今译: 和化于时支， 多财， 晚年发福。 ',
		未: '古诗: 值于未财亏禄少。\n今译: 七杀在时， 土犯水局， 不吉。 ',
		申: '古诗: 引居传送有旺者，金水之乡。\n今译: 金水两局， 上上之命。 ',
		酉: '古诗: 生居酉位彼旺也，为有辛伤。\n今译: 癸水喜乙， 见辛则有伤乙用神， 故曰， 有伤。 ',
		戌: '古诗: 戌内藏官有化也，干逢滋助。\n今译: 戌是财库， 见戊干为和化财， 此经以戊癸合火， 但有寅午戌， 任何一支， 皆可合化。 ',
		亥: '古诗: 育于亥建旺之乡。\n今译: 坐禄者， 只主长寿。 '
	}
};

// 日干
export const TYWX_DAYGAN = {
	甲:
		'古诗: 一世艰辛，阳金须广。\n今译: 阳金：庚。 广：天干地支加一起有三个以上的庚辛，而且地支要有一个申或者酉，就是广。 注：如果庚金不透干，只是地支4见庚辛金，只能作七杀多根论，主多犯小人。\n古诗: 田园异众，戊己皆淳。\n今译: 淳：地支有巳午，食伤生财，并且没有壬癸，甲乙反克。\n古诗: 至迈驱驱，因阳水而生于道路。\n今译: 地支三合三会水，透壬水\n古诗: 终身不聚，为干淳而四柱皆分。\n今译: 比肩，劫财干支四见地支又有寅卯，皆分指又见冲刑。\n古诗: 位显官崇，带双辛要兼旺癸。\n今译: 旺癸即是子，双辛是指辛酉，此即是官印双清， 正官格带印，需旺印，弱印的官印双清，职权要差一些。\n古诗: 清闲富庶，丙多而阳土临身。\n今译: 阳土临身是指甲戌，甲午曰土旺双巳午，即是自坐偏财，丙食神透干，而生自坐之偏财。\n古诗: 技艺聪明，丁广而火楚于象。\n今译: 象：三合三会。火楚于象，是指地支寅午戌透丁。三合三会伤官透伤官，只主才艺，（透财者富）。\n古诗: 柔中有吉，己身坐禄居寅。\n今译: 即甲寅日己巳时，己禄在巳，甲己和于财禄，主有仁信而富。\n古诗: 月气还亏，多立戎门官吏。\n今译: 日主在月上失令，多立又是另外有两种格局，成了身弱不能托财官的格局。戎门官吏，指不是主管，只是只奉命行事之人。\n古诗: 己身衰弱，萍梗乡外求亲。\n今译: 日主坐绝，庚见寅，辛见卯，壬见午，癸见巳，自绝之地，即是财旺之支，萍梗，日主无根又有冲刑者。他乡求亲。\n古诗: 合神见克，首妻必换。\n今译: 甲己合，己是正财，又见乙劫出干。正财克和互见者，双妻之命，以此类推。\n古诗: 鬼被干食，定应晚立儿孙。\n今译: 鬼是官鬼，干食是食神和官，指阳日主才有合官之组合。\n古诗: 俱旺不完，庚金建旺。\n今译: 不完，指不完美，不完整，指身体有亏损，庚金见旺是指4见庚辛金，地支有申酉，习称之为杀重身轻。\n古诗: 象不化兮，劳苦辛勤。\n今译: 象指月支之气象。不化是指甲己和生于寅卯申酉亥子月，为甲己不化。己虽然是财，不化之财，劳苦辛勤。\n古诗: 辰旺兮，心怀狠暴。\n今译: 四柱辰多，两个以上，皆主性情急躁，不能忍。\n古诗: 壬盛兮，难免灾迍。\n今译: 壬胜是指地支申子辰或亥子丑，天干又透壬，即4见壬癸，必主漂泊不定。',
	乙:
		'古诗: 一世快乐，阴土旺进禄成勋。\n今译: 乙木以己土为偏财，己旺在巳午，故此，四柱地支有巳午者（进禄）即是吉祥之命。\n古诗: 至迈驱驱，因癸水漂流南北。\n今译: 木日主忌水多，尤其同性之水。甲日忌壬水，故乙日忌癸水，主到老辛勤。 即乙日主，亥子丑全，兼透癸，或四见壬癸，支有亥子，四海漂流。\n古诗: 足富足贵，壬盛而复遇阴丁。\n今译: 丁壬合木，乙日主见壬旺而和丁者，主富贵。即是乙日主生于冬，透壬，又见丁。（此说以阴日主为限）\n古诗: 或贱或贫，辛强而重逢火位。\n今译: 辛是七杀，辛强指辛酉，遇丙字多，或生于巳午月。此说只有一个格局而又被合者，即是辛劳之命。\n古诗: 丙旺也贫异入舍。\n今译: 乙日主，丙旺伤官坐旺和七杀，只是平常人家。凡阴日主，皆为伤官和七杀。弱伤官坐禄合七杀，皆乃平常之命。\n古诗: 庚旺也光耀腾辉。\n今译: 乙日见庚，是合正官，但能生于秋即是佳命。\n古诗: 生逢衰地显禄也，难得多时。\n今译: 乙日生于申酉月，即是身衰。四柱即使有财官贵人，也享用不到很久，但也不是凶命，以日主衰弱之人，性格易于满足，安于守成。\n古诗: 禄鲜名薄居无气，必应不化。\n今译: 若生于秋，为己身薄，即使乙庚和官，也没有贵益。\n古诗: 己身建旺得月气，名誉东西。\n今译: 乙日生于寅卯月，为得月气建禄格，不见冲刑者，至少亦有文名。\n古诗: 自坐旺乡见克也，终须不畏。\n今译: 1.乙日卯时-建禄格不忌官杀局克日 2.正气五行，乙卯，辛酉，甲寅，庚申，壬子，丙午\n古诗: 甲丙重逢失时也，父亲难靠。\n今译: 乙日戊偏财为父，甲克戊，甲乙生丙，丙生戊，指自己要生扶父亲，而不能得父亲之财势。\n古诗: 财多印厚到衰乡，母必先亏。\n今译: 财印双克者，主不利母亲，大忌日主无根。\n古诗: 阳火阳金子少。\n今译: 阳火丙，阳金庚。指乙日主和庚金，庚又被丙克。即是克和并存，在广义上讲不利亲属。\n古诗: 阴土阴水双妻。\n今译: 阴土己偏财，阴水癸偏印，即是财印相克者，双妻之命。双妻是指两个女人并存，不是指先后易妻。\n古诗: 水盛财微性巧也，会诸技艺。\n今译: 水胜是印旺，生于冬季，土即是财，土衰于冬。也即是指印格坐旺者，只有专长之才，而不是商人之命。\n古诗: 五行见广得时也，智洪远机。\n今译: 智，指壬癸。得时指地支亥子多，水多者有智。\n古诗: 月中辛金入舍。\n今译: 乙日见辛酉月，日主乙又无寅卯者，入舍是指平常人家，或者是寄人篱下之意。\n古诗: 门逢戊土难移。\n今译: 乙木是柔木，无力去克强土，弱地支辰戌丑未多，又透戊，虽然是财也难以享用。\n古诗: 一世艰辛衰墓，愁逢有克。\n今译: 即是身衰逢杀，乙日主，地支申酉戌，透庚或辛。又不是生于申酉月，不能从杀，故曰，一世艰辛。\n古诗: 生逢死地逢金，无处安身。\n今译: 此条于前一条类似。\n',
	丙:
		'古诗: 单身孤寡在衰乡失地。\n今译: 此经是生旺库的层次，是以衰与死绝同论。即丙日生于亥子曰，又透壬，主孤寡。又不能从杀。\n古诗: 财丰家盛为四柱皆通。\n今译: 四柱无冲刑，但有一财官之禄旺地支，即是小康富命。\n古诗: 禄显三重官居上宰。\n今译: 丙禄在巳午，见三丙，地支巳等，曰：三重，必有职权。\n古诗: 俱高四柱禄有千钟。\n今译: 高是旺禄之支，凡财官印贵人通根旺禄者，皆主吉命。\n古诗: 若遇阳水必须横夭。\n今译: 若申子辰透壬，有意外之灾。经曰：丙临申位逢阳水，透出天年未可知。\n古诗: 或逢阴累困难途中。\n今译: 己土，亥水。己伤官，壬七杀，己土混了壬水，主多经困扰。\n古诗: 怕甲嫌丁败散兮，贫寒顷刻。\n今译: 忌甲偏印于劫财，同时天透地藏，此说10天干，皆能适用。劫财透干，忌偏印不透干，2者并见，命格大忌。\n古诗: 怜庚爱戊聚福兮，自已多荣。\n今译: 庚是偏财，戊是食神。食神生偏财多福。食神生正财则要差一些。总之禄命法重偏财。\n古诗: 合神广见不离，初年失母。\n今译: 丙辛和，为干合。丙以乙为母，若辛财四柱太多又坐旺。即是辛财克乙母，故曰：失母。\n古诗: 比肩重犯父亡，岂到年终。\n今译: 比肩是克财（父）之神。 天干明见比肩，地支有禄旺之根巳午，则主妇妾皆凶。 天干明见比肩，地支没有巳午，只作无禄。\n古诗: 两目多昏，遇水沉。\n今译: 丙日主地支申子辰含水，主有损目之疾。\n古诗: 身居巳午，祸难候。\n今译: 巳午是丙之禄，凡有日主之禄旺者，皆不畏七杀之克，反作身杀两停论吉。\n古诗: 憐庚忧戊能除愚。\n今译: 指食神生财之吉。\n古诗: 支内喜逢寅午戌\n今译: 基于火土同生旺，丙见寅午戌是比劫刃，戊见寅午戌是印，故丙见寅午戌是比印合局，财杀皆为可用之神。\n',
	丁:
		'古诗: 三宫有气旺发也，官居显职。\n今译: 三宫是指月日时，三个地支中，只要有一个地支是巳午，也就是日主的旺位，在四柱之中，有财官印贵人旺支者，即是佳命。此即是，习称之身旺可托财官。\n古诗: 四柱长旺祖高也，积累簪缨。\n今译: 长是甲印旺，能生日主，与调候用神相同。即丁日主，四柱多甲印，即是佳命。\n古诗: 壬水多逢争化也，空门道士。\n今译: 壬与丁为干合，若三个壬合一个丁，为阳水灭火，主漂流，尤其又是生于冬月，争化不化皆为不吉。丁火最忌水多，丙火不忌。\n古诗: 月中水旺离门户，行脚高僧。\n今译: 此是指丁日主亥子月，有会申子辰，或亥子丑，天干透壬或癸。\n古诗: 流落一身见化也，生逢旺水。\n今译: 此节与前一节相似，只是多了一项天干丁壬合，又值旺水之局。\n古诗: 财多自损成木，而长遇金坑。\n今译: 丁壬合木，若遇秋月，合会金局，又透金，主自身有疾。\n古诗: 子少也干逢暗损。\n今译: 今日医学发达，避孕者多，故子息不太准确。\n古诗: 妻灾怕遇重丁。\n今译: 是指天干有两个丁比肩，此论，十干通用。\n古诗: 甲盛也平生掌握。\n今译: 此说日主，调候相同。甲为丁之喜神，四柱有甲寅者，佳命。\n古诗: 乙多者处世难停。\n今译: 丁火必须木旺支木，乙之柔木，难生丁火。（此中以调候，日主性为主）\n古诗: 干见财多应克母。\n今译: 财克印，唯一未说明者是庚辛财，地支没有旺根申酉，否则只是缘薄。\n古诗: 支逢印旺父母还倾。\n今译: 印是春生亥卯未，寅卯辰。旺是夏生寅午戌，巳午未。\n古诗: 火旺离宫恐失时\n今译: 与前节近似，丁日主，忌冬生，合会水局，又透水。\n',
	戊:
		'古诗: 掌握威权，见阴水能滋阳土。\n今译: 阴水是癸，戊癸合火，反成戊之印，乙卯则是官禄之吉。\n古诗: 无食弃业，遇辛被甲伤残。\n今译: 戊土无甲，则无木梳土，但也不能甲木太旺。故此戊日主之四柱，最忌四柱无金，旺甲伤土，主人有残伤。\n古诗: 贵显三公有秀气，学堂之命。\n今译: 戊长生在寅，只要有长生即是秀，主有学。\n古诗: 身迁两府象成兮，廉正之官。\n今译: 象成，即是辰戌丑未全，或是午月支寅午戌透火成局。\n古诗: 肌瘦形微失地也，病多痨嗽。\n今译: 衰地，指地支完全没有辰戌，丑未，巳午者，主体弱。同时又见天干戊癸合，合而不化。\n古诗: 身衰财旺，图财而犯法遭愆。\n今译: 戊日主地支亥子丑，又透壬，并且地支没有巳午之支，因财引祸。\n古诗: 子嗣难存须逢庚食。\n今译: 男命戊日以乙木为子，若庚金坐实而合乙，则子息被合。\n古诗: 单身至迈戊土皆全。\n今译: 天干见三个戊字，戊以癸为妻，多比肩而和妻，指难有良好家室。此项可以通用与五阳干，取比肩合财。阳干天干两比肩出天干者，婚姻皆有严重之失衡。\n古诗: 祖上高名岁逢阴木。\n今译: 阴木即是乙。若乙未，乙卯年出生，主出生世家。年上正官格者，出生世家。\n古诗: 自身卓立门户伤残。\n今译: 日主自坐财官旺位者，乃是自己之福，不得祖业荫。\n古诗: 卯酉重遇定为奴。\n今译: 戊以甲乙木为用，最忌乙卯，辛酉之正冲。下吏，是指有能力为别人办事，而自己没有职权。\n古诗: 辰戌叠犯带卯兮，累受宣敕。\n今译: 戊以辰戌为本位，卯是木之旺位，即是身强能用官。 戊土用财喜亥子，食伤生财，天干又庚辛。 戊土用官喜辰戌丑未，土本气以托甲乙之旺官。\n古诗: 合神暗会，常怀萦恼之牵。\n今译: 十天干相同即是合神太多，一戊见二，三个癸，一甲见二，三个己，一乙见两三个庚等。\n古诗: 足智多淳至旺乡。\n今译: 戊日主地支有辰戌丑未或巳午者，即使是格局弱，无调候，也是有智谋之人。\n古诗: 身居死墓定为殃。\n今译: 戊日主地支亥卯未全，又透甲乙天干者，必主伤身。\n古诗: 受临四季常须善。\n今译: 戊日主生于辰戌丑未月者，即是善良之人。\n古诗: 引至寅乡福必藏。\n今译: 寅是指甲寅，乃旺木克土。此经并不重视寅中丙印之长生位，但以旺木坐根为祸。寅若不透甲，不会寅卯辰亦无大碍。\n古诗: 三宫无倚亦须伤。\n今译: 三宫是指月日时，无依是指无格可取，又见冲刑主伤身。\n',
	己:
		'古诗: 富贵双全显赫也伏晶建旺。\n今译: 四柱中，甲官杀或丙印，透干成格者，即是好命。此说以己日主甲丙为用神。\n古诗: 贫穷至迈居衰乡相克相刑。\n今译: 四柱见乙木，为凶兆，亦忌冲刑。无乙木，不甚忌冲。己日主喜忌，习用为丙，此经注明最忌见乙木与冲刑。\n古诗: 阴水重逢妻旺必须置妾。\n今译: 阴水是癸，即是偏财，天干两见偏财者，不必偏财旺根，也主有女人之缘。\n古诗: 阳金迭遇子难图纵立刑伤。\n今译: 己日主以木为子，四柱见庚申者，主子息迟。\n古诗: 官印相持癸旺也宜居四季。\n今译: 己日主只要能生于辰戌丑未月得令，四柱只要有任何一个财旺官旺的地支，即是佳命。\n古诗: 己身淳秀水多而财产丰盈。\n今译: 淳秀，是指月令生于辰戌丑未月当令。水是财，透壬癸水者，即是富命。\n古诗: 进表承恩得气也阳干火土。\n今译: 即是生于四柱有甲寅丙午，木火阳土，即是佳命。\n古诗: 身亏低下受气也阴木重逢。\n今译: 己日主最忌乙木坐根，或天干两见乙木，主凶兆。\n古诗: 月气冬生克母也劳产之病。\n今译: 生于亥子月，也就是财当令，对母亲最不利。\n古诗: 旺逢克制父亏兮肿气遭刑。\n今译: 旺逢克制，日主戊己太多，又坐根重，比劫制财，涵盖了父妻皆受伤。\n古诗: 身坐衰乡有化也身迁重爵。\n今译: 衰乡，指甲寅木旺之地，但甲与己和，得辰戌丑未之地，即是真化，如此反凶为吉。\n古诗: 己身建旺见败而怎用能才。\n今译: 败指正偏财相难，（壬子）等多因异性儿耽误正事。\n',
	庚:
		'古诗: 禄马重逢有气也，三台之命。\n今译: 即是丁甲生旺寅午为佳命。丙乙生卯巳则差一些。\n古诗: 旺乡迭遇显官印，位列中郎。\n今译: 此经虽然没明白说日主喜忌，在推论之中，明白只出了庚日，必须以丁为第一优先之喜用。\n古诗: 幼岁离祖居乾方，路逢丙火。\n今译: 乾是金，年月有申酉劫财。不大忌成申子辰透水。\n古诗: 延年寿考在坤位，又遇金乡。\n今译: 坤是未，乙财之库，在时支。若生于申月，有寿有福之人。\n古诗: 失地身衰，忌临旺火。\n今译: 地支没有申酉之支，最忌有丙丁坐巳午明火。\n古诗: 贫穷下贱，土地相伤。\n今译: 戊为土，土重埋金，地支四见戊字，无用之人。\n古诗: 运至离宫见克也，大肠之病。\n今译: 庚日地支没有申酉，大运到巳午火地，有大肠之病。\n古诗: 在于本位气坚而性率高强。\n今译: 庚日生于申酉月，则为金当令，为人率性而不让。\n古诗: 合神交杂必是多妨妻妾。\n今译: （异性缘复杂）合神，阳日主，日主和正财。交杂，是指一庚见二乙，或两更见一乙，不利妻子。\n古诗: 食多财盛，立子襁褓中凶。\n今译: 指申子辰透壬合丁用神，寅卯辰透甲和己印，故曰，幼年凶。\n古诗: 失母，合多见广。\n今译: 乙为日主之和神，乙是财印是母，乙多是财多，财多见克印，失母。\n古诗: 克父，财到衰乡。\n今译: 此指比劫根重，庚以寅卯为财，木绝在申酉。申酉即是日主之旺支同时又是财的衰乡。 此说只适用于庚辛，壬癸，其余甲乙丙丁戊己是日主绝于七杀，不是绝在财。\n',
	辛:
		'古诗: 己身逢旺，见伤也，祸害难侵。\n今译: 生于申酉月，不忌官杀。（四见透干令论）\n古诗: 旺在秋生，带印也，官居武职。\n今译: 建禄带印格。\n古诗: 生居孟夏，有官兮，命列旌旗。\n今译: 孟夏，巳月，即是丙正官之根，巳中丙出天干，和辛者吉。\n古诗: 食不充餐，丁旺也，亦居绝处。\n今译: 1.辛日主必须用壬水位日主用神。2.一但透丁，则合去壬水用神，故主绝处。\n古诗: 形无衣蔽，壬水盛，时日皆衰。\n今译: 1.有日主之喜，日主至少也要有根，身不能无根。2.日主用神不能太多，太多指申子辰又透壬。\n古诗: 财在旺乡，支远也，图之难遂。\n今译: 指干支异位，辛日主甲为财，甲旺在寅。却见月干甲，时支寅。曰，支远，如此中年亦大利，须待时干支年限50岁后，才见成效。\n古诗: 食居门户，旺近也，乐得安栖。\n今译: 食，食神生财。门居，食神生财在月日，与日干近。故此，可中年安康。\n古诗: 见败逢败，夏生兮，子孙早立。\n今译: 败指沐浴，金沐浴在午，即是官杀。地支日月见巳午者，子息早（男以官杀为子）。\n古诗: 纯阴水土，秋降也，妻必主离。\n今译: 辛见水，癸水是食神，己土是偏印。即是食神见偏印，虽然指破格也主妻离。\n古诗: 财旺也，必先克母。\n今译: 财克印不利母。\n古诗: 生气盛，父必伤亏。\n今译: 比劫克财不利父。\n',
	壬:
		'古诗: 水盛滔滔，妻病也，产痨而死。\n今译: 亥子丑会水又透壬，比劫会局透比劫，十干皆妨妻。\n古诗: 比肩重犯，母衰兮，脚病身殂。\n今译: 比劫各有根重，壬子癸亥等，在年月则妨父，直接指母衰。\n古诗: 官印冬生，父遭小肠之厄。\n今译: 冬生者亥子丑会局，直接克偏财父火。\n古诗: 食多印厚，克妻也，子息难图。\n今译: 印克食伤局，指破格者，不利亲属。\n古诗: 长生四柱禄马旺，乘驷马之车。\n今译: 日主只要有长生，禄，库三者具备其中之一，另再有财官贵人即是佳命。\n古诗: 至老无居阳土盛，用神无气。\n今译: 壬水忌戊忌出干，地支四柱皆有土之根。\n古诗: 他乡外立阴水旺，引从身虚。\n今译: 壬日主地支亥子丑，透癸水，不能作从旺，只能作他乡外立。\n古诗: 禄厚财丰冬降也，必逢丙火。\n今译: 壬水冬生，必以丙为调候。\n古诗: 身无寸土夏生兮，戊土临躯。\n今译: 壬水夏生（巳午未）月，最忌戊土坐根重。\n古诗: 克妻，则合多印厚。\n今译: 合多，天干丁壬合妻，支会亥子丑，克妻。印是金，妻是火，财坐印，或是印坐财，都做妨妻论。\n古诗: 无嗣，则盛而食多。\n今译: 此是以官杀为子，食神多，则克官杀（子）。\n',
	癸:
		'古诗: 职禄俱全，官封印旺。\n今译: 不取财，癸水之官是戊，癸水之印是庚，戊旺在巳午，庚申酉。\n古诗: 少年败散，鬼病财微。\n今译: 财微，水克火为财，火败在亥子，即是年上比劫坐禄。\n古诗: 祖上名高，岁居有气。\n今译: 年上财官有根。\n古诗: 年中困塞，为失其时。\n今译: 年柱地支财官坐绝。\n古诗: 自坐衰乡有克者，脚膝之病。\n今译: 日主无根，又见官杀旺，主有疾。\n古诗: 自身健旺遇水兮，妻必先亏。\n今译: 比劫会局又透壬癸，克妻。\n古诗: 四水朝元有气也，身居八位。\n今译: 四柱皆水成全水局，从旺，吉命。\n古诗: 三元羸弱，支克而官职则卑。\n今译: 月日时，日主无根，又见冲刑，则没有官禄之分。\n古诗: 至老鳏居水盛也，火生绝处。\n今译: 会水局夏生，透壬癸，难有佳妻。\n古诗: 三妻二妾干杂兮，火旺金实。\n今译: 天干丙丁财杂透，地支又见巳午未，主有女人缘。\n古诗: 暗损多逢无救也，必应绝嗣。\n今译: 地支多冲无和，子息迟。\n古诗: 终身不遂，遇衰乡，迢迢东西。\n今译: 日主无根者东奔西走。\n古诗: 财到旺乡，重见兮，父母有失。\n今译: 癸水财旺，是巳午未，火必克印（母）。\n古诗: 鬼居本位，叠遇兮，流落身衰。\n今译: 鬼，七杀，癸以己为七杀，天干两己，地支丑未多，难有安定之生涯。杀重身轻。\n古诗: 长生土乡，无化也，难图厚利。\n今译: 生于辰戌丑未月，天干戊癸合见和而不化，也无大利。\n古诗: 生逢水旺，纵亏兮，亦有衣食。\n今译: 水旺比劫多，虽然破财，也不会没有基本生涯。比劫破财不至于没有衣食。\n'
};
